{
    "text":"Subscribe to DeepL Pro to edit this document.Visit www.DeepL.com/pro for more information.
In connection with RODO, or Regulation (EU) R2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data and repealing Directive 95/46/EC (General Data Protection Regulation), effective as of May 25, 2018, we inform you about our Privacy Policy. This document is the implementation of the information policy towards persons using the application for ordering transportation services and concluding contracts for the transportation of persons or goods by cab (hereinafter referred to as the \"Application\") persons ordering transportation services through the website in the domain https://www.personaltaxi.pl/ (the \"Site\") and through the national telephone exchange 605665462 (the \"Exchange\") or by any other means, as well as persons contacting the controller of personal data, i.e. Inter-Dywiz sp. z o.o., in all aspects of the processing and protection of personal data. We attach great importance to the protection, collection, processing and use of your personal data in accordance with applicable regulations. The Administrator makes every effort to ensure that the information concerning you remains private. Accordingly, we publish a document explaining the rules and how we collect, process and use information about the users of the Application and the Site and other persons whose personal data we process. Please read the document carefully to understand our privacy policy and how we use your personal information. We would like to inform you that Inter-Dywiz Ltd. complies with all applicable data protection laws. We respect and protect your privacy, and we assure you that we will answer all your questions about data protection and ensure that your rights are exercised at all times. Therefore, please read the following information carefully. Your personal data is processed on the basis of applicable laws and regulations, in particular the European Parliament and the Council (EU) 2016/679 of April 27, 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data and the repeal of Directive 95/46/EC (hereinafter: the \"Regulation\") and the Law of May 10, 2018 on the Protection of Personal Data (hereinafter: the „\Law\").
<br></br>
1. information regarding the Administrator and the collection of personal data<br></br>
<br></br>

1 The Administrator within the meaning of Article 4 point 7 of the Regulation (EU) 2016/679 of the European Parliament and of the Council of April 27, 2016 on the protection of natural persons with regard to the processing of personal data and on the free flow of such data and repealing Directive 95/46/EC with regard to your personal data is Inter-Dywiz sp. z o.o. with its seat in Krakow, Lotnicza 6/2 Street, 31-462 Krakow, registered in the Register of Entrepreneurs of the National Court Register under KRS: 0000496661, NIP: 6751496482, REGON: 123040168 (hereinafter the Administrator).
<br></br>

(2) Personal data is all information about a natural person identified or identifiable by one or more factors specific to physical, physiological, genetic, mental, economic, cultural or social identity, including device IP, location data, Internet identifier and information collected through cookies and other similar technology <br></br>

(3) By means of the Application, the Administrator collects your personal data such as your name, surname, telephone number, e-mail address and, if contacted by the Headquarters, also your voice. The Administrator processes the personal data you provide in order to conclude and execute agreements, including for electronically provided services, for the purpose necessary to use the Website and the Application, in particular to set up an account, to enable you to search for a cab service in the Application and to provide other functions of the Application and to use other services of the Administrator, including the Headquarters, in particular, in order to place an order via the website or Headquarters, to verify and execute a current order for cab transportation and service the order placed, to send information with a summary of the course, to contact for the purposes of course execution, including by drivers, to process complaints, as well as to assert and defend against claims, and furthermore for marketing purposes and to contact the Administrator. Provision of the indicated personal data is necessary for the conclusion and execution of the contract for the use of the website and its functions, including the ability to search for the service of transporting people and things by cab using the website, and their processing is carried out on the basis of Article 6(1)(b) of the Regulation.<br></br>

(4) If you place an order via the website, the Administrator shall further process your location data (GPS data) at the time of the order, the coordinates of the pickup location and the coordinates of the destination, as well as travel time data (e.g., pickup time and time to reach the destination). Consent for the transmission of GPS location data is given through the operating system of your terminal device. In addition, the administrator processes data regarding the trip: cost, payment, invoices, driver id, passenger id, device id. The processing of this data is necessary for the performance of the contract for the use of the website and its functions, including the ability to search for the service of transporting people and things by cab using the website, and their processing is carried out on the basis of Article 6 (1) (b) of the Regulation. You may optionally also enter your home and work address on the website. These data are processed insofar as they are provided by you.<br></br>

(5) The Administrator shall allow you to make a cashless payment via the website using a credit card, PayPal account, Google Pay account, Apple Pay, BLIK or Przelewy24. For this purpose, it may be necessary for you to provide your card number, card expiration date, CVV2/CVC2 code. However, the administrator does not have access to or process this data. Providing the indicated personal data is necessary to make a non-cash payment for a cab ride using the Application in accordance with the selected payment method, and their processing is carried out on the basis of Article 6(1)(b) of the Regulation. You can always make payment by credit card or cash with the driver. For the purposes referred to in this section, the data referred to in this section may be transferred to payment providers-payment service providers.<br></br>

(6) By placing an order through the Site, the Administrator collects your personal data such as name, phone number. The Administrator processes the personal data you provide for the purpose necessary to place an order, perform the service of providing a tool (the Site) to place an order for cab transportation, as well as to assert claims. The provision of this personal data is necessary for the conclusion and execution of the agreement to provide a tool (the Site) for placing an order for the transportation of people and goods by cab through the Site, and their processing is carried out on the basis of Article 6(1)(b) of the Regulation. <br></br>

(7) When placing an order through the Switchboard, the Administrator collects your personal data such as name, phone number, voice. The Administrator processes the personal data you provide for the purpose necessary to place an order, implement the service of providing a tool (Switchboard) for placing an order for cab transportation, as well as to assert claims. The provision of this personal data is necessary for the conclusion and execution of the contract for the provision of a tool (PBX) for placing an order for the transportation of people and goods by cab, and their processing is carried out on the basis of Article 6(1)(b) of the Regulation.<br></br>

(8) In order to carry out an order for transportation services using a "voucher", the Administrator processes the personal data of the person using the "voucher" option in the form of a telephone number, and the processing of such personal data is carried out pursuant to Article 6(1)(f) of the Regulation. The processing of the personal data provided is necessary for the purposes of the legitimate interests pursued by the Administrator, i.e. to provide an appropriate tool for placing an order for cab transportation for the benefit of the person using the "voucher" option. 8.<br></br>

In addition, the Administrator collects and processes your personal data in the form of your name, telephone number, email address on the basis of Article 6(1)(f) of the Regulation, i.e. the Administrator's legitimate interest, which is direct marketing of its own services, as well as research, in particular through surveys, satisfaction with services, with the proviso that with regard to services constituting provision of services by electronic means within the meaning of the Act of July 18, 2002. on the provision of services by electronic means, the Administrator may process data, only with your consent and for the purposes of advertising, market research and research into the behavior and preferences of service recipients with the purpose of using the results of such research to improve the quality of services provided by the Administrator (which also applies to profiling), other data concerning you that are not necessary for the provision of services by electronic means. You may object to such processing at any time, which will result in the immediate cessation of the Administrator's processing of your personal data for this purpose, and in the case of processing on the basis of consent, you may revoke (withdraw) your consent at any time.<br></br>

(9) The processing of personal data in the form of name, phone number, e-mail address for marketing purposes carried out by the Administrator's Partners may be carried out only with your consent, pursuant to Article 6(1)(a) of the Regulation. Consent to the processing of personal data in such cases includes consent to the processing of personal data for marketing purposes of the Administrator and its Partners, such as subcontractors, companies and cab corporations, partners running social media, advertisers and entities co-organizing marketing actions, promotions, contests, etc. with the Administrator. However, in this case, no personal data are transferred to these entities for marketing purposes, and are processed exclusively by the Administrator, including through automated marketing tools. Provision of personal data for these purposes is voluntary and at the discretion of the data subject, and their processing by the Administrator is subject to obtaining consent. You may withdraw your consent at any time without affecting the lawfulness of the processing performed on the basis of consent before its withdrawal. More extensively on the conditions for granting and withdrawing consent in Section 3 of this policy.<br></br>

10 The Administrator processes the personal data you provide in the contact form in order to provide the service provided electronically - contact form. For this purpose, the Administrator collects your personal data such as name, e-mail address, telephone number. Providing your e-mail address is necessary for responding to your inquiry submitted through the electronic contact form. In the case of your request for telephone contact, it is also necessary to provide your telephone number. Processing is carried out on the basis of Article 6(1)(b) of the Regulation.<br></br>

(11) Where data processing is optional, data will be processed on the basis of consent, which will be evident from the content of the consent given. Data may also be processed on the basis of the legitimate interest of the Administrator. The extent of the data processed depends, in particular, on the form you fill out and the service or form of contact you use. The Administrator may apply different levels of consent, on which depends the scope of the processed data, as well as the manner and purposes of processing.<br></br>

12 The Administrator also uses the information contained in cookies for analytical purposes. They provide data about your activity in the use of the Application. The use of cookies is based on your consent. You can disable cookies at any time by changing the settings in your browser. Details on how to use cookies can be found in the Cookie Policy.<br></br>

13. In order to provide you with the most effective use of the website and also to tailor its content and be able to offer you the most customized offer, we will process data in the form of:<br></br>

-cookies<br></br>

- The dates and times of your visit to the website,<br>/br>

- The characteristics of your device, in particular the operating system, web browser and the size of the<br>/br>

browser window,<br>/br>

- IP address of your device,<br>/br>

- Device identifiers, which consist of individual characteristics of your mobile device. IDs
devices allow us to recognize your device on our site.<br>/br>

14 The Site performs functions of acquiring information and personal data about users and their behavior also by storing cookies (so-called "cookies") in the end devices. The Administrator uses the information contained in cookies to improve the functioning of the Site. They provide data about user activity on the Site. The use of cookies is based on your consent. You can disable cookies at any time by changing the settings in your browser. The rules of use are defined in the Cookies Policy.<br>/br>

15 The Administrator is an entrepreneur and constantly strives to improve the products and tools he uses to develop our business. Therefore, he strives to ensure that his Websites are designed in the best way and that as many people as possible who are interested in doing business with him visit them. To improve the quality of the Site, the Administrator may use tools commonly referred to as "trackers." They allow us to monitor the effectiveness of web offers. With them, we can collect such data as :<br>/br>

- information through which links online users are redirected to the Site<br></br>

- information on when and how often the Site was visited<br></br>

- information what kind of information is searched,<br></br>

- which links or offers are opened on the Site.<br></br>

Based on the above information, the Administrator may create statistics to help make the Site more attractive and better tailored to the needs and preferences of visitors.<br></br>

The Administrator does not create user profiles. The use of these tools does not automatically identify individuals and never uses them to identify visitors to the Site.<br></br>

(16) With respect to your personal data, the Administrator does not make automated decisions within the meaning of the Regulation, except that: - Your data may be profiled for the purpose of providing personalized content in the Application, i.e. the implementation of the Application's function of presenting an offer of cab transportation services as close to your preferences as possible <br></br>
- applies to the situation of the introduction of such functionality of the Application.<br></br>

- data about the use of the Application and services offered through the Application, as well as <br></br>
contact data may be used for the purpose of sending personalized messages regarding the use of the Administrator's services<br></br>

Such processing is necessary for the performance of a contract for the use of the Application or another contract for a service provided electronically, pursuant to the wording of Article 22(1)(a) of the Regulation;<br></br>

(13) The Administrator shall retain your personal data only for the period necessary for the performance of the services provided, including the assertion of claims and compliance with the requirements of applicable laws, including tax laws, or for the period necessary for other purposes for which the Administrator may process your data in accordance with this Privacy Policy. In the case of personal data processed on the basis of the Administrator's legitimate interest, including for the purpose of providing a service using a "voucher", the Administrator shall keep the personal data provided for the period necessary for the purpose of processing or until you file an effective objection. In the case of personal data processed for the Administrator's direct marketing purposes, the Administrator shall retain the personal data provided for the period necessary for the purpose of processing or until an effective objection is raised. In the case of personal data processed on the basis of your consent, the Administrator shall keep the personal data you provide for the period necessary for the purpose of processing or until you withdraw your consent. After these periods, your personal data will be deleted.<br></br>

(14) When contacting through the Central Office, a special message informs the caller that the telephone conversation is being recorded. The condition for the continuation of the telephone conversation is the submission of a statement of consent to its recording. The consent can be given by the caller voluntarily continuing the call or in any other way implied by the message. Failure to submit a statement of consent to record the call will result in the call not being recorded and will be terminated.<br></br>

2 Rights of the data subject<br></br>

(1) You have the right to obtain from the Administrator confirmation as to whether it processes your personal data, the right to request access to such data, and the right to obtain from the Administrator information regarding the purposes of processing and the categories of personal data processed, information about the recipients or categories of recipients to whom the personal data are disclosed, the intended period of storage of the personal data, the source of the data in case it was collected not from the data subject, and information as to whether the Administrator makes automated decisions with respect to the data subject, including, but not limited to, on the basis of profiling. You also have the right to obtain a copy of the data.<br></br>

(2) In addition, you have the right to request rectification of personal data, the right to request erasure of personal data, the right to request restriction of processing, the right to data portability and the right to object to processing. You may exercise these rights:<br></br>

- with respect to a request for erasure: when the personal data are no longer necessary for the purposes for which they were collected or otherwise processed, when the data subject has withdrawn the consent on which the processing is based and there is no other legal basis for the processing, when the data subject objects under Article 21(1) to the processing and there are no overriding legitimate grounds for the processing, or the data subject objects under Art. 21(2) of the Regulation against processing, when the personal data has been unlawfully processed, when the personal data must be erased in order to comply with a legal obligation under Union law or the law of a Member State to which the Controller is subject, when the personal data has been collected in connection with the offering of information society services,<br></br>

- With regard to a request for rectification of data: when your data is incorrect or incomplete; with regard to a request for erasure of data: when your data is no longer necessary for the purposes for which it was collected by the Administrator; you withdraw your consent to data processing; you object to the processing of your data; your data is processed unlawfully; your data should be erased in order to comply with a legal obligation, or your data was collected in connection with offering information society services;<br></br>

- With regard to a request for restriction of data processing: when your data is incorrect - you may request restriction of processing for a period allowing the Administrator to verify the correctness of the data; processing of your data is being carried out unlawfully, but you do not want it to be deleted; your data will no longer be needed by the Administrator, but will be needed by you to establish, assert or defend claims; or you have lodged an objection to data processing - until it is determined whether the legitimate grounds on the part of the Administrator override the grounds for the objection;<br></br>

If processing has been restricted, such personal data may be processed, with the exception of storage, only with the consent of the data subject, or to establish, assert or defend claims, or to protect the rights of another natural or legal person, or for compelling reasons of public interest of the Union or a Member State.<br></br>

- With regard to the right to data portability: when the processing of your data takes place on the basis of your consent or contract, and when the processing is carried out by automated means;<br></br>

- With regard to the right to object: when the processing of your personal data is carried out on the basis of a legitimate interest and the objection is justified on the grounds of your particular situation, as well as when your personal data is processed for direct marketing purposes, including profiling.<br></br>

(3) You also have the right to lodge a complaint with a supervisory authority if you consider that the processing of personal data concerning you violates the Regulation.<br></br>

4 The security procedures implemented mean that we may ask for proof of identity before exercising your rights.<br></br>

3. consent to process personal data<br></br>

(1) If the Administrator processes personal data that are not necessary for the performance of the service, the provision of such data by you is always done voluntarily, after you have given your consent to the processing of the data provided.<br></br>

(2) You give your consent after reviewing this policy by checking the appropriate checkbox. In this case, you consent to the Administrator's collection and processing of the personal data you have provided for the purpose expressly indicated when you give your consent.<br></br>

(3) You may withdraw your consent at any time, in the same manner as your consent was given, i.e. by unchecking the appropriate checkbox. In addition, you may withdraw your consent by sending a statement of withdrawal of consent to the Administrator in the manner indicated in Section 6 of this policy. (4) Withdrawal of consent does not affect the lawfulness of processing that was carried out on the basis of consent before its withdrawal.<br></br>

(4) The Administrator uses different levels of consents, which may be characterized by different scope of data processing and different purpose of processing. In particular, separate consents may relate to such forms and purposes of processing such as: transfer of data to another controller, processing of data for email contact, processing of data for telephone contact, processing of data for marketing purposes, profiling, processing of data in the use of cookies. Each purpose and scope of data processing results from the content specified in the consent form. Please read this content before submitting your statement of consent. In addition, you may be asked for additional consents resulting from specific regulations, such as for the use of a telecommunications terminal device or the sending of commercial information by electronic means.<br></br>

4 Information on recipients / categories of recipients of personal data<br></br>

(1) In order to provide and settle the cab service, the Administrator will transfer your data, including personal data to the following recipients:<br></br>

- Location data (GPS coordinates of the pickup address), coordinates of the destination, as well as travel time data (e.g., pickup time and arrival time at the destination), will be provided to drivers who apply for the course;<br></br>

- Location data (GPS coordinates of the pickup address), coordinates of the destination, as well as travel time data (e.g., pickup time and time to reach the destination) and your personal data in the form of your name and phone number will be provided to drivers who have accepted the order for cab service.<br></br>

Since the implementation of the cab service may also be carried out through entities operating cab corporations or other subcontractors, the above data may be transferred to such entities for onward transmission to drivers.<br></br>

(2) The Administrator also makes partial use of third-party service providers who process personal data on behalf of the Administrator, such as hosting providers, email service providers, system providers for marketing and emailing, website traffic analysis, marketing campaign effectiveness analysis, account functionality support, debt collection companies, payment service providers. However, the transfer of data can only be used to provide their service. The Administrator uses only such entities that provide sufficient guarantees for the protection of data subjects' rights. The processing of personal data by these entities is carried out on the basis of written agreements concluded with the Administrator. These entities follow the Administrator's guidelines and are subject to audits conducted by the Administrator.<br></br>

(3) Recipients of your data may include:<br></br>

(a) the Administrator's contractors and their subcontractors, insofar as your data will be necessary for the performance of the contract or other cooperation linking the Administrator with the above entities. In the absence of such need, the Administrator's contractors will not be recipients of the data;<br></br>

(b) the Administrator's customers, insofar as your data will be needed to perform the contract linking the Administrator with the above entities. In the absence of such necessity, the Administrator's clients will not be recipients of the data;<br></br>

c) entities cooperating with the Administrator for the purpose of performing a contract or cooperation, fulfilling obligations under the law or other purposes for which the Administrator may process your data, such as companies providing hosting services, accounting, etc.<br></br>

(4) Your personal data may also be made available to entities entitled to obtain them under applicable law, e.g. law enforcement agencies in the event of a request by the authority on the appropriate legal basis (e.g. for the purposes of ongoing criminal proceedings).<br></br>

(5) The Administrator uses the Google Analytics service to analyze web traffic, to collect and analyze data on the behavior of people using the Application or the Administrator's websites. Web traffic analysis is mainly used for website optimization and marketing purposes. In accordance with the specified functionalities of Google Analytics, Google Analytics also piques "cookies" and the data contained therein may be used for marketing purposes, and the data contained therein may also be used for profiling.<br></br>

The operator of the Google Analytics service is Google Inc., 1600 AmphitheatrePkwy, MountainView, CA 94043-1351, based in the USA. The user may not consent to the collection of data related to the use of information collected by Google Analytics, and to the processing of such data by Google, and may prevent such activities. To do so, download a browser add-on available here: tools.google.com/dlpage/gaoptout, and then install it.<br></br>

Terms of use: http://www.google.com/analytics/terms/pl.html<br></br>

Privacy Policy: https://policies.google.com/privacy?hl=pL<br></br>

(6) The Administrator may also r use the remarketing feature of Google AdWords at Google Inc, 1600 AmphitheatreParkway, MountainView, CA 94043, USA. Remarketing allows you to create a personalized "cue" to a recipient who has previously viewed a particular page/pages on Google Inc.'s website in order to display an advertisement for a product/service you may be interested in. For this purpose, cookies are stored in your browser that are collected from individual pages you visit through your Google browser. User visits are collected through cookies that are used to identify the browser of the device itself; personal data is not stored. You can restrict or disable Google's storage of cookies at any time by following the indicated link : www.google.com/settings/ads/plugin. For more information on Google Adwords and Google's privacy policy, please visit: www.google.com/privacy/ads.<br>/br>

(7) Cookies may be used by advertising networks, in particular the Google network, to display advertisements tailored to the user's use of the Site. For this purpose, they may retain information about the user's navigation path or how long the user stayed on a particular page.<br></br>

(8) The administrator also has a fanpage on the Facebook website to which links contained in the Site direct. Accordingly, data in the form of name or email address may be collected and subsequently shared with the Facebook operator, in which case the data processing is performed for the purpose of using the Administrator's page on Facebook and marketing with the help of Facebook.The Site may use the social plugins (SocialPlugins) of the social network Facebook.com, managed by Facebook Inc., 1601 S. California Ave, PaloAlto, CA 94304, USA ("Facebook"). The plug-ins are marked with the portal's logo, its icon or the add-on "Facebook SocialPlugin". If the User launches a website that contains such a plug-in, the browser will establish a direct connection to the Facebook server. The content of the plug-in is directly transferred by Facebook.com to the browser and integrated by it into the website. Inter-Dywiz Ltd. has no influence in this respect on the size of the data that Facebook collects via this plug-in. If you are a member of Facebook but do not want the portal to associate the collected user data, you must make the appropriate settings on your Facebook account. It is the responsibility of this entity to grant access to your data that you have made available to Facebook, and if you have any doubts, you should contact this entity directly or make changes to your Facebook account settings On a similar basis, the indicated data may be transferred to other similar social networks and the entities that run them.<br></br>

(9) In addition, in connection with the Administrator's use of Google services, e.g. the G Suite service, data may be transferred outside the EEA only, however, with guarantees that an adequate degree of protection is ensured, e.g. under the standard contractual clauses approved by the European Commission.<br></br>

(10) For the purposes of the legitimate interests pursued by the Administrator, which is the enforcement of claims, your personal data in the scope of identification, contact and address data may be transferred to debt collection companies and other entities providing services related to the recovery of claims.<br></br>

11. your data may also be transferred to authorities that may request them in accordance with the law.<br></br>

5. personal data security<br></br>

(1) The Administrator shall process your personal data in accordance with the provisions of the Ordinance, including the use of appropriate technical and organizational measures to ensure the security and adequate confidentiality and integrity of personal data, including protection against unauthorized access, against unauthorized or unlawful processing, and against accidental loss, unauthorized alteration, destruction or damage.<br></br>

(2) When downloading your personal data within the framework of account registration in the Application, their transmission is carried out using an encrypted SSL connection.<br></br>

6. contact information<br></br>

(1) Any demands, requests, notifications, inquiries relating to the processing of personal data can be addressed to you via the contact form located on the website www.personaltaxi.pl, by e-mail to: biuro@personaltaxi.pl or in writing to Inter-Dywiz sp. z o.o. ul. Lotnicza 6/2 31-462 Kraków.<br></br>"
}